module.exports.config = {
    name: "سب",
    version: "1.0.0",
    hasPermssion: 1,
    credits: "...",
    description: "",
    commandCategory: "ادمنية الكروبات",
    usages: "سب @mention",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("تحتاج الى عمل تاك لشخص لشتمه \n تحذير : هذا الامر يحتوي على هواي كلمات الحساسة للبعض ", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("انا صاحب هذا القروب وانا مسؤول عنكم امام الله والشعب وانتم تلامذتي وانا استاذكم سوف اعطيكم مزيد من البصيرة الوعي !");
setTimeout(() => {a({body: "انت عندك نقص بشخصيتك بسبب اهلك يجوز سايگين عليك أو ولد المنطقة مسويك ميز مال تنمّر عليك وعلى شكلك ف لهذا تريد تعوّض النقص البداخلك  بهيج سوالف فارغة مثلك ومثل صاحبك الثاني لا واصلاً من تحجي بالكروب محد مهتملك وكلهم لابسيك يسلّكون براسك لأن انت وضيع وعديم قيمة وشخصيتك تحت الضعيفة انت واحد منغولي معيدي المن عايش حياتك روح شوف شغلة تسويها يا متخلف هو انت ضعيف شخصية وبيك عقد نفسيه لان بالواقع شخصيتك متخلخلة من كد ما يفشلونك وحتى يتنمرون عليك ف تشوف الكل مثلك" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "ولك هو انت بيتك ماتكدر تطبله لان تلعب نفسك تجي تطب تلكه امك حاطة كسها بلسنكي تروح لاختك اختك ماهيه راحت تجيب خبز صارلها من الصبح لهسه" + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "شنو رأيك ادزلك صورة عيري وبيه فلتر مال بزونة بالسناب شات " + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "ترة ابوك اشعلة لا تشوفني ساكت وتجفص بمصاريني ترة هسة اذبلك حچاية اخليك للصبح تبچي" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "انت متأثر بالافلام هواي لعد لو تشوف افلام امك يخطفوها ويريدون ينيجوها بأخر لحظه اجي انقذها واني انيجها" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: " شگد سعر الكوميديا عندك بيع النا منها " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "حطلع عيري وادحسة بكسمك خوش واخليها تصرخ ويجيك اخ غير شرعي وياخذ منك الورث" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "روح شوف الامريكان كل ما يضوجون يفوتون على امك يفرغون شهوتهم بيها وأنت تگول فاست مستر فاست غفي شوكلتة غفمي" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "طبعا صورة عيري تسربت لجهاز اختك وراحت عند المصور طبعتها وعلگتها بالحايط بدال شهادة التخرج" + " " + name, mentions: arraytag})}, 23000);
setTimeout(() => {a({body: "ابن الكحبه ابن بلاعت العير كسختك يعني البارحه جنت طالع وانتة سويتلي تاك وتغلط على اختي واني لا يمك ولا حواليك دتصير الفقير مال كروب شنو اركعك بالنعال وين ماشوفك ابو العيوره" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "سوي چارة لامك ياديوث !" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "انيج ابوك ع صدر امك" + " " + name, mentions: arraytag})}, 31000);
setTimeout(() => {a({body: "تعال فرخ شو ضام راسك ؟" + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a({body: "دا اسمع راب واني" + " " + name, mentions: arraytag})}, 39000);
setTimeout(() => {a({body: "هضيمه شاب  مثلك ليهسه عايش لك موت والله احسن الك و للمجتمع يا اخي وجودك ماله اي معنه بالحياة والله لا فايد اهلك لا فايد روحك لا مأسسلك عائلة لا عندك مهنه لا شهادة لا خلقه لا شي يعني حياتك عبارة عن فراغ والله حط طلقة براسك  حرامات محسوب فرد ع العراق و مكلف الدولة تموينية جريمة بيك كيلو التمن و الطحين حصتك من البطاقة موت اخويه موووتت" + " " + name, mentions: arraytag})}, 40000);
setTimeout(() => {a({body: "عندي وجبتين الك وحدة لحلكك و وحدة لطيزك بس اختار ياهية لطيزك و ياهية لحلكك موجود خرة و قنادر" + " " + name, mentions: arraytag})}, 65000);
setTimeout(() => {a({body: "انت واحد منغولي معيدي المن عايش بحياتك روح شوف شغلة تسويها احسن من ما تشوف امك وهية ينيجون بيها صغار كبار يا متخلف يا زمال يا منغولي" + " " + name, mentions: arraytag})}, 70000);
setTimeout(() => {a({body: "😒😒😒 لتطردني ابن المطي اطرد الي خلاني اسبك  " + " " + name, mentions: arraytag})}, 75000);
setTimeout(() => {a({body: "امك حاطة كسها بلسنكي " + " " + name, mentions: arraytag})}, 80000);
setTimeout(() => {a({body: "شوف حبي من تشوفني خانس وساكت لا تشمر علي طابوگة ترة اني مجاي انيچ بامك" + " " + name, mentions: arraytag})}, 85000);
setTimeout(() => {a("امك صايرة ترند باليوتيوب مطلعة صدرها روح لحك عليها ")} , 90000);
setTimeout(() => {a({body: "يا اخي وجودك ماله اي معنه بالحياة" + " " + name, mentions: arraytag})}, 95000);
setTimeout(() => {a({body: "سوي چارة لامك ياديوث !" + " " + name, mentions: arraytag})}, 100000);
setTimeout(() => {a({body: "اصلاً من تحجي بالكروب محد مهتملك وكلهم لابسيك " + " " + name, mentions: arraytag})}, 105000);
setTimeout(() => {a("لتطردني ابن المطي اطرد الي خلاني اسبك 🥺")} , 110000);


  
  }